# Conexiones a BBDD usando Python

<img width="600" height="300" src="./img/sqlpython.png" align='middle'>

`Python` es un lenguaje de programación de alto nivel, de propósito general y muy popular. Básicamente, fue diseñado con énfasis en la legibilidad del código y los programadores pueden expresar sus conceptos en menos líneas de código. También podemos usar `Python` con `SQL`. En este artículo, aprenderemos cómo conectar `SQL` con `Python` usando el módulo `'MySQL Connector Python'`. El diagrama que se muestra a continuación ilustra cómo se envía una solicitud de conexión al conector Python de `MySQL`, cómo se acepta desde la base de datos y cómo se ejecuta el cursor con los datos de resultados.

<img width="630" height="300" src="./img/SQLConnection.jpg">

## Conectar SQL con Python

Para crear una conexión entre la base de datos MySQL y Python, se utiliza el método `connect()` del módulo `mysql.connector`. Pasamos los detalles de la base de datos como *HostName*, *nombre de usuario* y *contraseña* en la llamada al método, y luego el método devuelve el *objeto de conexión*.

Se requieren los siguientes pasos para conectar `SQL` con `Python`:

- **Paso 1**: **Descargue e instale** la base de datos `MySQL` gratuita.

- **Paso 2**: ahora ejecute los comandos que se indican a continuación para descargar e instalar `"Conector MySQL"`. Aquí, la instrucción `mysql.connector` lo ayudará a comunicarse con la base de datos `MySQL`.

- **Paso 3**: ahora ejecute los comandos que se indican a continuación para descargar e instalar `"Conector MySQL"`. 

    `pip install mysql-connector-python`

- **Paso 4**: para **verificar si la instalación fue exitosa** o si ya instaló `"MySQL Connector"`, vaya a su IDE y ejecute el siguiente código:

    `import mysql.connector`

- **Paso 5**: Ahora, para conectar `SQL` con `Python`, ejecute el código que se proporciona a continuación en su IDE.

In [1]:
from getpass import getpass
from mysql.connector import connect, Error

try:
    # Si la conexion se da satisfactoriamente, tendremos 
    # un mensaje de éxito. 
    conn = connect(
                    host="localhost",
                    user=input("Enter username: "),
                    password=getpass("Enter password: "),
                    database="chinook")
         
    print('SUCCESSFUL\n\n')
except Error as e:
    # En caso de tener un error de conexión, lo mostramos
    print(e)

Enter username: root
Enter password: ········
SUCCESSFUL

In [17]:
conn

Explicación de cada componente

<img src="./img/connect-props.jpg">

- **`mysql.connector`** permite que los programas de `Python` accedan a bases de datos `MySQL`.
- El método **``connect()``** de la clase MySQL Connector con los argumentos se conectará a ``MySQL`` y devolverá un objeto ``MySQLConnection`` si la conexión se establece correctamente.
- **usuario = “tunombredeusuario”**, aquí “tunombredeusuario” debe ser el mismo nombre de usuario que estableciste durante la instalación de ``MySQL``.
- **contraseña = “tu_contraseña”**, aquí “tu_contraseña” debe ser la misma contraseña que estableciste durante la instalación de ``MySQL``.
- **``cursor()``** se usa para ejecutar las declaraciones ``SQL`` en ``Python``.
- El método **``execute()``** se usa para compilar una declaración ``SQL``.

## Acceder a tablas en la BBDD

Primero mostramos las tablas disponibles en nuestra base de datos

In [18]:
cursor = conn.cursor()
cursor.execute("SHOW TABLES")

for x in cursor:
  print(x)

('album',)
('artist',)
('customer',)
('employee',)
('genre',)
('invoice',)
('invoiceline',)
('mediatype',)
('playlist',)
('playlisttrack',)
('track',)

In [26]:
show_db_query = "SELECT * FROM album LIMIT 10"

with conn.cursor() as cursor:
    cursor.execute(show_db_query)
    ls_albums = cursor.fetchall()

In [21]:
show_db_query = "SHOW DATABASES"
print(show_db_query)
with conn.cursor() as cursor:
    cursor.execute(show_db_query)
    for db in cursor:
        print(db)
print("\n\n")

select_movies_query = "SELECT * FROM album LIMIT 5"
print(select_movies_query)
with conn.cursor() as cursor:
    cursor.execute(select_movies_query)
    result = cursor.fetchall()
    for row in result:
        print(row)

    print('\n', cursor.column_names)

# conn.close()

SHOW DATABASES
('chinook',)
('information_schema',)
('mysql',)
('performance_schema',)
('sys',)



SELECT * FROM album LIMIT 5
(1, 'For Those About To Rock We Salute You', 1)
(2, 'Balls to the Wall', 2)
(3, 'Restless and Wild', 2)
(4, 'Let There Be Rock', 1)
(5, 'Big Ones', 3)

 ('AlbumId', 'Title', 'ArtistId')

In [15]:
cursor.fetchall()

[(1, 'For Those About To Rock We Salute You', 1),
 (2, 'Balls to the Wall', 2),
 (3, 'Restless and Wild', 2),
 (4, 'Let There Be Rock', 1),
 (5, 'Big Ones', 3)]

In [61]:
conn.close()

## Crear nueva BBDD

In [29]:
mydb = connect(
        host="localhost",
        user=input("Enter username: "),
        password=getpass("Enter password: "),
)
 
# Creating an instance of 'cursor' class
# which is used to execute the 'SQL'
# statements in 'Python'
cursor = mydb.cursor()
 
# Creating a database with a name
# 'geeksforgeeks' execute() method
# is used to compile a SQL statement
# below statement is used to create
# the 'geeksforgeeks' database
cursor.execute("CREATE DATABASE newdatabase")

In [30]:
show_db_query = "SHOW DATABASES"
print(show_db_query)
with mydb.cursor() as cursor:
    cursor.execute(show_db_query)
    for db in cursor:
        print(db)
print("\n\n")

SHOW DATABASES
('chinook',)
('information_schema',)
('mysql',)
('newdatabase',)
('newdatabase1',)
('performance_schema',)
('sys',)

In [31]:
mydb.close()

In [59]:
try:
    # Si la conexion se da satisfactoriamente, tendremos 
    # un mensaje de éxito. 
    mydb = connect(
        host="localhost",
        user=input("Enter username: "),
        password=getpass("Enter password: "),
        database="newdatabase")
         
    print('SUCCESSFUL\n\n')
except Error as e:
    # En caso de tener un error de conexión, lo mostramos
    print(e)
 
# cursor = mydb.cursor()
 
# Creating a table called 'gfg' in the
# 'geeksforgeeks' database
# cursor.execute("CREATE TABLE codewars (name VARCHAR(255), user_name VARCHAR(255))")

SUCCESSFUL

In [35]:
cursor.execute("CREATE TABLE codewars (name VARCHAR(255), user_name VARCHAR(255))")

In [42]:
# Show existing tables
cursor.execute("SHOW TABLES")

for x in cursor:
  print(x)

InternalError: Unread result found

In [36]:
cursor.execute("""INSERT INTO codewars (name, user_name) VALUES ("Guille", "guilleordaz")""")

In [38]:
cursor.execute("""INSERT INTO codewars (name, user_name) VALUES ("Alberto", "wallace-80")""")

In [39]:
mydb.commit()

In [69]:
with mydb.cursor() as cursor2:
    cursor2.execute('''SELECT * FROM codewars''')
    print(cursor2.fetchall())

[('Guille', 'guilleordaz'), ('Alberto', 'wallace-80')]

In [54]:
cursor = mydb.cursor()
cursor.execute('''
SELECT * FROM codewars
''')

In [55]:
cursor.fetchall()

[('Guille', 'guilleordaz'), ('Alberto', 'wallace-80')]

In [70]:
mydb.close()

In [71]:
conn = connect(host="localhost",
                user='root',
                password=getpass("Inserte contrasena:"),
                database='chinook')

In [77]:
with conn.cursor() as cursor:
    cursor.execute('''SELECT * FROM invoice''')
    ls_invoice = cursor.fetchall()
    col_names = cursor.column_names

In [74]:
import pandas as pd

In [78]:
df_invoice = pd.DataFrame(ls_invoice, columns=col_names)
df_invoice

,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,1,2,2009-01-01,Theodor-Heuss-Straße 34,Stuttgart,None,Germany,70174,1.98
1,2,4,2009-01-02,Ullevålsveien 14,Oslo,None,Norway,0171,3.96
2,3,8,2009-01-03,Grétrystraat 63,Brussels,None,Belgium,1000,5.94
3,4,14,2009-01-06,8210 111 ST NW,Edmonton,AB,Canada,T6G 2C7,8.91
4,5,23,2009-01-11,69 Salem Street,Boston,MA,USA,2113,13.86
...,...,...,...,...,...,...,...,...,...
407,408,25,2013-12-05,319 N. Frances Street,Madison,WI,USA,53703,3.96
408,409,29,2013-12-06,796 Dundas Street West,Toronto,ON,Canada,M6J 1V1,5.94
409,410,35,2013-12-09,"Rua dos Campeões Europeus de Viena, 4350",Porto,None,Portugal,None,8.91
410,411,44,2013-12-14,Porthaninkatu 9,Helsinki,None,Finland,00530,13.86
411,412,58,2013-12-22,"12,Community Centre",Delhi,None,India,110017,1.99

In [79]:
df_invoice = pd.read_sql('''SELECT * FROM invoice''', con=conn)

C:\Users\alber\AppData\Local\Temp\ipykernel_24112\4051214635.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_invoice = pd.read_sql('''SELECT * FROM invoice''', con=conn)

In [81]:
df_album = pd.read_sql('''SELECT * FROM album''', con=conn)

C:\Users\alber\AppData\Local\Temp\ipykernel_24112\2649136265.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_album = pd.read_sql('''SELECT * FROM album''', con=conn)

In [80]:
df_invoice

,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,1,2,2009-01-01,Theodor-Heuss-Straße 34,Stuttgart,None,Germany,70174,1.98
1,2,4,2009-01-02,Ullevålsveien 14,Oslo,None,Norway,0171,3.96
2,3,8,2009-01-03,Grétrystraat 63,Brussels,None,Belgium,1000,5.94
3,4,14,2009-01-06,8210 111 ST NW,Edmonton,AB,Canada,T6G 2C7,8.91
4,5,23,2009-01-11,69 Salem Street,Boston,MA,USA,2113,13.86
...,...,...,...,...,...,...,...,...,...
407,408,25,2013-12-05,319 N. Frances Street,Madison,WI,USA,53703,3.96
408,409,29,2013-12-06,796 Dundas Street West,Toronto,ON,Canada,M6J 1V1,5.94
409,410,35,2013-12-09,"Rua dos Campeões Europeus de Viena, 4350",Porto,None,Portugal,None,8.91
410,411,44,2013-12-14,Porthaninkatu 9,Helsinki,None,Finland,00530,13.86
411,412,58,2013-12-22,"12,Community Centre",Delhi,None,India,110017,1.99

In [82]:
df_album

     AlbumId                                              Title  ArtistId
0          1              For Those About To Rock We Salute You         1
1          2                                  Balls to the Wall         2
2          3                                  Restless and Wild         2
3          4                                  Let There Be Rock         1
4          5                                           Big Ones         3
..       ...                                                ...       ...
342      343                             Respighi:Pines of Rome       226
343      344  Schubert: The Late String Quartets & String Qu...       272
344      345                                Monteverdi: L'Orfeo       273
345      346                              Mozart: Chamber Music       274
346      347  Koyaanisqatsi (Soundtrack from the Motion Pict...       275

[347 rows x 3 columns]